'''
	[문제]
		
        랜덤숫자(1~9)사이의 숫자를  여섯개를 출력하고 
        각 숫자를 더하거나 빼는 식을 만들어 출력하시오..
        랜덤숫자가 홀수이면 더하기를 하고,
        랜덤숫자가 짝수이면 빼기를 하시오.
        단, 마지막숫자는 영향이 없다. 

        5 7 6 2 3 1 이라고하면

        5는 홀수이므로 더하기
        7은 홀수이므로 더하기
        6은 짝수이므로 빼기
        2는 짝수이므로 빼기
        3은 홀수이므로 더하기
        1은 마지막이므로 영향이 없다. 

        5 + 7 + 6 - 2 - 3 + 1 이된다. 

'''
# 랜덤숫자(1~9)사이의 숫자를  여섯개를 출력하고 
# 랜덤숫자가 홀수이면 더하기를 하고,
# 랜덤숫자가 짝수이면 빼기를 하시오.
# 단, 마지막숫자는 영향이 없다. 
import random

r = random.randint(1, 9)

total = r

i = 0 
while i < 6 :
    
    print(r, end = " ")    
    
    if i < 5 : 
        r = random.randint(1 ,9)

        if r % 2 == 1 :
            print(end = " + ")
            total += r
        elif r % 2 == 0 : 
            print(end = " - ")
            total -= r 
    
    if i == 5 :
        print(" =", total)
   
    i += 1 
