'''
	[문제1]
		인형 125개가있다. 전체를 100퍼센트라고했을때, 
		일퍼센트는 인형몇개인지구하시오.
	[풀이1]
		100% : 125개 = 1% : n개
		100 x n = 125 x 1
		100n = 125
		100n / 100 = 125 / 100
		n = 1.25개

	[문제2]
		인형 125개가있다. 인형1개는 몇퍼센트인지 구하시오.
	[풀이2]
		125개 : 100% = 1개 : n%
		125 x n = 100 x 1
		125n = 100
		125n / 125 = 100 / 125
		n = 0.8%

	[문제3]
		인형 40개가있다. 전체를 100퍼센트라고했을때, 
		일퍼센트는 인형몇개인지구하시오.
	[풀이3]
		100% : 40개 = 1% : n개
		100n = 40
		100n / 100 = 40 / 100
		n = 0.4개

	[문제4]
		인형 40개가있다. 인형1개는 몇퍼센트인지 구하시오.
	[풀이4]
		40개 : 100% = 1개 : n%
		40n = 100
		40n / 40 = 100 / 40
		n = 2.5%
'''		

print("문제1 : " , 125 / 100)
print("문제2 : " , 100 / 125)
print("문제3 : " , 40 / 100)
print("문제4 : " , 100 / 40)