<script>
/*
	철수는 학교에서 산수시험을 봤다. 
	a배열의 숫자와 b배열의 숫자의 각각의 값의 합을 구하는 시험이다.
	시험은 인덱스 순차적으로 제시된다.	
	철수의 답안지와 비교해서 철수의 정답개수를 출력하시오.	
	아래 답안지는 철수가 작성한답이다. 
	철수는 답을 문제순서대로 적은것이 아니라 뒤죽박죽 적었다.
	위 문제의 해답이 철수의 답안지에 있으면 정답이다.
	단, 같은 인덱스의 자리가 아니여도 상관없다. 

	var a = [4, 65, 23, 1, 45, 7];
    var b = [61, 2, 54, 3, 5, 6];		
    var 철수 = [67, 13, 2, 22, 65, 4];
	
	정답은 [ 65, 67, 77, 4, 50, 13 ] 이고,
	철수의 답은 [67, 13, 2, 22, 65, 4] 이다.
	위치에 상관없이 정답을 찾는 문제이므로 , [65, 67, 4, 13] 총 4문제를 맞췄다. 

	

*/

	var a = [4, 65, 23, 1, 45, 7];
    var b = [61, 2, 54, 3, 5, 6];		
    var 철수 = [67, 13, 2, 22, 65, 4];

	var sum = [];

	for(var i = 0; i < a.length; i++){
		sum[i] = a[i] + b[i];
	}
	var count = 0;
	for(var i = 0; i < 철수.length; i++){
		for(var j = 0; j < sum.length; j++){
			if(sum[i] == 철수[j]){
				console.log(철수[j]);
				count += 1;
			}
		}
	}
	console.log("개수 : " + count);




</script>