'''
	[문제]
		철수는 두 번의 시험에서 각각 80점과 72점을 받았다.
		세 번째 시험에서 최소 몇 점 이상을 받아야 
		
		세 번의 시험성적의 평균이 82점 이상이 될 수 있을까?
		시험점수는 1점 단위로 설정된다.
	[정답]
		94
'''
'''
시험1 = 80
시험2 = 72
시험3 = x 

평균 = 82

(시험1 + 시험2 + 시험3) / 3 >= 평균 
'''
# [1110]
# 시험1 = 80
# 시험2 = 72
# x = 0

# 평균 = 82

# while True :
# 	if (시험1 + 시험2 + x) / 3 >= 평균 :
# 		시험3 = x 
# 		break
# 	x += 1 

# print("최소 받아야하는 점수 =",시험3)

"""
시험1 = 80
시험2 = 72
시험3 = x 

(시험1 + 시험2 + x) / 3 >= 82
"""
# []
# 시험1 = 80
# 시험2 = 72
# 시험3 = 0 
# # 평균 = (시험1 + 시험2 + 시험3) / 3

# run = 1
# while run == 1 : 
# 	if (시험1 + 시험2 + 시험3) / 3 >= 82 : 
# 		print("시험3 =", 시험3)
# 		run = 0
# 	else :
# 		시험3 += 1

# print("시험3 =", 시험3)




		
