'''
	[문제]
		철수는 13살 철수의 아버지는 45살이다. 
		몇 년 후 철수의 아버지는 철수 나이의 3배가 될지 구하시오.
	[정답]
		3
'''
'''
철수 = 13
아버지 = 45 

몇 년 x 

(철수 + x) * 3 = 아버지 + x 
39 + 3x = 45 + x 
2x = 6
x = 6
'''
# [1110]
# 철수 = 13
# 아버지 = 45

# x = 0

# while True :
# 	if (철수 + x) * 3 == 아버지 + x :
# 		print("몇년 =", x)
# 		break 
# 	x += 1 
# print(x)
'''
철수 = 13
아버지 = 45

배수 = 3
몇년 = 3 

3(13 + x) = 45 + x  
39 + 3x = 45 + x 
2x = 6
x = 3
'''
# []
# 철수 = 13
# 아버지 = 45
# 배수 = 3
# 몇년 = 0

# run = 1
# while run == 1 : 
# 	if (철수 + 몇년) * 3 == 아버지 + 몇년 :
# 		print("몇년? ", 몇년)
# 		run = 0
		
# 	else :
# 		몇년 += 1

# # print("몇년 =", 몇년)
