# 메모(주석 : comment)

# 주석이란, 프로그램이 실행될때 작동되지않고 오로지 설명을 위한 내용을 적을때 사용.

# 주석 하는법 1) 한줄주석 : 주석할내용앞에 #(샾기호) 를 붙인다. 글씨색이 변한다. 

# 주석 하는법 2) 여러줄주석 : 여러줄주석일 경우 모든 내용앞에 #을 붙이는건 번거로울수있다. 
#                여러줄은 처음에 홑따옴표 3개 마지막에 홑따옴표3개를 한다.

# 주석 하는법 3) 여러줄 주석 : 처음에 쌍따옴표 3개 마지막에 쌍따옴표 3개 

# 아래 예시를 통해 확인해보자

# 한줄주석의 예

#        동해 물과 백두산이 마르고 닳도록
#        하느님이 보우하사 우리나라 만세.
#        무궁화 삼천리 화려 강산
#        대한 사람, 대한으로 길이 보전하세.


# 여러줄 주석의 예
'''
        동해 물과 백두산이 마르고 닳도록
        하느님이 보우하사 우리나라 만세.
        무궁화 삼천리 화려 강산
        대한 사람, 대한으로 길이 보전하세.	
'''

"""
        동해 물과 백두산이 마르고 닳도록
        하느님이 보우하사 우리나라 만세.
        무궁화 삼천리 화려 강산
        대한 사람, 대한으로 길이 보전하세.	
"""
# 한 줄 주석
'''
여러줄
주석
'''
"""
여러
줄 주석
"""
# 여러줄주석












