# 출력문 

# 출력문은 화면에 내용을 출력할때 사용한다. 

# 사용하는법  
# print(출력할내용)

# 주의
# 반드시 가장왼쪽벽에 붙여서 코드를 작성한다.

# 출력문을 작성후엔 반드시 저장을 한다. 
# 저장 : Ctrl + S
# 실행 : 오른쪽 상단 모서리의 삼각형 아이콘 클릭


# 출력할내용이 문자일경우는 홑따옴표를 양쪽에 붙이거나 쌍따옴표를 양쪽에 붙인다. 둘다 상관없다.
print("안녕하세요.")
print('반갑습니다.')

# 출력할내용이 정수인경우는 그냥 숫자만적는다. 
# 정수란? 소수점이 없는수
print(58)

# 출력할내용이 실수인경우는 소수점아래는 . 을 이용한다.
# 실수란? 소수점이 있는수
print(3.14)

# 숫자와 문자를 한번에 출력하기 
# 숫자와 문자를 한번에 출력할때는 ,(콤마) 를 사용해야한다. 아니면 에러가 발생한다. 
print("사과" , 5 , "개를 주세요.")

print("파이썬 ", 2, "번째 실습예제")