<script>
    /*
    	문제1) 회원별 아이템 구매목록 출력 
		예) 
			[이만수 ==> 고래밥3,칸쵸1] 
			[김철민 ==> 고래밥1] 
			[이영희 ==> 고래밥1,새우깡2]
		
		문제2) 아이템별로 판매개수출력
		예) [고래밥 ==> 5][새우깡 ==> 2][칸쵸 ==> 1]
    */

		var itemData = "1001/고래밥,1002/새우깡,1003/칸쵸";
		var userData = "3001/이만수,3002/김철민,3003/이영희";
		
		var cartData = "";
		cartData += "3001/1001\n";
		cartData += "3001/1001\n";
		cartData += "3003/1002\n";
		cartData += "3001/1001\n";
		cartData += "3001/1003\n";
		cartData += "3003/1002\n";
		cartData += "3003/1001\n";
		cartData += "3002/1001\n";
  </script>